Австралия/src/Catalogs/Numerators/Numerators.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Numerators</name>
  <predefined>
    <items>
      <name>Default</name>
      <description>Default</description>
    </items>
  </predefined>
  <attributes>
    <name>Periodicity</name>
    <type>
      <types>EnumRef.NumeratorsPeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberFormat</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>NumericNumberPartLength</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IndependentNumberingByDocumentTypes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IndependentNumberingByOperationTypes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IndependentNumberingByCompanies</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IndependentNumberingByBusinessUnits</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IndependentNumberingByCounterparties</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Example</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/Numerators/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Returns a structure of the Numerators fields
//
// Returns:
//   Structure
//     Description
//     Periodicity
//     NumberFormat
//     IndependentNumberingByCompanies
//     IndependentNumberingByDepartment
//     IndependentNumberingByDocumentKind
//     IndependentNumberingByProject
//     IndependentNumberingByActivityIssue
//     LinkType
//
Function GetNumeratorsStructure() Export
	
	NumeratorsParameters = New Structure;
	NumeratorsParameters.Insert("Description");
	NumeratorsParameters.Insert("Periodicity");
	NumeratorsParameters.Insert("NumberFormat");
	NumeratorsParameters.Insert("IndependentNumberingByDocumentTypes");
	NumeratorsParameters.Insert("IndependentNumberingByOperationTypes");
	NumeratorsParameters.Insert("IndependentNumberingByCompanies");
	NumeratorsParameters.Insert("IndependentNumberingByBusinessUnits");
	NumeratorsParameters.Insert("IndependentNumberingByCounterparties");
	
	Return NumeratorsParameters;
	
EndFunction

// Creates and writes Numerator to the database
//
// Parameters:
//   NumeratorStructure - Structure - a numerator field structure.
//
Function CreateNumerator(NumeratorStructure) Export
	
	NewNumerator = CreateItem();
	FillPropertyValues(NewNumerator, NumeratorStructure);
	NewNumerator.Write();
	
	Return NewNumerator.Ref;
	
EndFunction

#EndRegion

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	NativeLanguagesSupportServer.ChoiceDataGetProcessing(
		ChoiceData,
		Parameters,
		StandardProcessing,
		Metadata.Catalogs.Numerators);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationGetProcessing(Data, Presentation, StandardProcessing);
	
EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationFieldsGetProcessing(Fields, StandardProcessing);
	
EndProcedure

#EndRegion

#EndIf
